// pages/index/assembleRule/assembleRule.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    text:[
      "（1）团长：团长是指该团第一位支付成功的人。团长购买拼团商品，完成支付后，团即刻开启。",
      "（2）邀请好友参团：团长开团后可以将团链接分享给好友，购买该商品的好友即为参团成员，参团成员也可以分享团链接邀请更多的成员参加。",
      "（3）拼团成功：开团24小时内达到规定的成团人数，即可拼团成功，系统给发货。",
      "（4）快速成团：系统会在拼团商品详情页内不定时随机推荐尚未拼团成功的团，帮助团长和参团成员拼团，但不保证一定会推荐哦，未来及时买到超值好物，分享给好友一起拼最快捷哦。",
      "（5）拼团失败：开团24小时内未找到响应人数的好友参团，该团失败，系统自动退款。",
      "（6）取消订单：团里的人数超过1人时，团里的订单不支持取消订单。团尚未拼成时，团长订单取消会导致整个团拼团失败。",
      "（7）优惠券、现金礼包、礼品卡：拼团商品暂不支持使用优惠券、现金礼包、礼品卡。",
      "（8）差价：拼团用户需要通过“多人一起购买”才能享受拼团价，因此不支持给以非团购价“单独购买”的用户补贴差价。"
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})