// pages/agreement/agreement.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    cont:[
      [
        {titleH2:'一、 小红猪使用规则'},
        [
          { 
            text:"（1）团长：团长是指该团第一位支付成功的人。"
            },
          {
            text:'（2）邀请好友参团：团长开团后可以将长购买拼团商品，完成支付后，团即刻开启。'
          },
          {
            text: '（3）邀请好友参团：团长开团后可以将长购买拼团商品，完成支付后，团即刻开启。'
          }
        ]
      ],
      [
        { titleH2: '二、 所有权，知识产权' },
        [
          {
            text: "团长：团长是指该团第一位支付成功的人。团长购买拼团商品完成支付后，团即刻开启。快速成团：系统会在拼团商品详情页内不定时随机推荐"
          }
        ]
      ],
      [
        { titleH2: '三、 协议修改' },
        [
          {
            text: "团长：团长是指该团第一位支付成功的人。团长购买拼团商品完成支付后，团即刻开启。快速成团：系统会在拼团商品详情页内不定时随机推荐"
          }
        ]
      ],
      [
        { titleH2: '四、 隐私条款' },
        [
          {
            text: "团长：团长是指该团第一位支付成功的人。团长购买拼团商品完成支付后，团即刻开启。快速成团：系统会在拼团商品详情页内不定时随机推荐"
          }
        ]
      ],
      [
        { titleH2: '五、 协议终止' },
        [
          {
            text: "团长：团长是指该团第一位支付成功的人。团长购买拼团商品完成支付后，团即刻开启。快速成团：系统会在拼团商品详情页内不定时随机推荐"
          }
        ]
      ],
      [
        { titleH2: '六、 协议终止' },
        [
          {
            text: "团长：团长是指该团第一位支付成功的人。团长购买拼团商品完成支付后，团即刻开启。快速成团：系统会在拼团商品详情页内不定时随机推荐"
          }
        ]
      ],
      [
        { titleH2: '七、 协议终止' },
        [
          {
            text: "团长：团长是指该团第一位支付成功的人。团长购买拼团商品完成支付后，团即刻开启。快速成团：系统会在拼团商品详情页内不定时随机推荐"
          }
        ]
      ]
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})